# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/headonly"

# Cask dependencies
brew "mas"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"
brew "antigen"

# CLI utilities
# Note: This replaces some (outdated) built-in macOS utilities with the GNU equivalents
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "git"
brew "grep"
brew "pv"
brew "pwgen"
brew "rsync"
brew "screen"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "wget"

# Other useful tools
brew "highlight"

# Compression tools
brew "gzip"
brew "snappy"

# Mac OS tools
brew "duti" # Required for setting preferences
brew "tccutil" # Required for setting preferences

# Programming languages
# Installing Python/Ruby with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "go"
brew "pyenv" # Python

# Install GUI applications
cask "1password"
cask "atom"
cask "bettertouchtool"
cask "captur"
cask "daisydisk"
cask "dropbox"
cask "evernote"
cask "gpg-suite"
cask "harvest"
cask "iterm2"
cask "jump"
cask "kindle"
cask "macdown"
cask "osxfuse"
cask "protonmail-bridge"
cask "protonvpn"
cask "protonmail-unofficial"
cask "superduper"
cask "tunnelblick"
cask "the-unarchiver"

# Browsers
cask "brave-browser"

# Virtulization applications
cask "vagrant"
cask "vagrant-manager"
cask "docker"

# Developer IDE's
cask visual-studio-code
cask atom

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "webpquicklook"

# Color Picker plugins
cask "colorpicker-skalacolor"

# Apple MAS applications
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Xcode", id: 497799835
