# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/headonly"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

# CLI utilities
# Note: This replaces some (outdated) built-in macOS utilities with the GNU equivalents
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
brew "git"
brew "grep"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "wget"
brew "mkdocs"


# Compression tools
brew "gzip"

# Programming languages
# Installing Python/Ruby with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "pyenv" # Python

# Network tools
brew "tor"
brew "nmap"
brew "speedtest_cli"

# Install GUI applications
cask "1password"
cask "atom"
cask "bettertouchtool"
cask "captur"
cask "daisydisk"
cask "dropbox"
cask "evernote"
cask "gpg-suite"
cask "harvest"
cask "iterm2"
cask "jump"
cask "kindle"
cask "macdown"
cask "osxfuse"
cask "protonmail-bridge"
cask "protonvpn"
cask "protonmail-unofficial"
cask "slack"
cask "superduper"
cask "tunnelblick"
cask "the-unarchiver"
cask "visual-studio-code"
cask "workflowy"


# Browsers
cask "google-chrome"
cask "firefox"


# Virtulization applications
cask "virtualbox"
cask "vagrant"
cask "vagrant-manager"

# Services
cask "markdown-service-tools"



# MAS applications
# Get a list of installed MAS apps with:
# `brew bundle dump --file=- | egrep ^mas`


# Apple MAS applications
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
